INTRODUCTION TO PANDAS

In [2]:
import pandas as pd
import numpy as np

Series is very similar to numpy array, it is actually built on numpy array object.

In [3]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a' :10, 'b': 20, 'c': 30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

Series can hold any type of data unlike numpy arrays.

DATAFRAMES

In [9]:
from numpy.random import randn

In [10]:
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df
# each column is actually a pandas series.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [14]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
df[['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [16]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [23]:
df['new'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [26]:
df.drop('new', axis = 1, inplace = True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [28]:
df.shape

(5, 4)

In [30]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
df.loc['A','W']

2.706849839399938

In [34]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [36]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [37]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
df[df['W'] > 0 and df['Y'] > 1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [46]:
df[(df['W'] > 0) & (df['Y'] > 1)]
# Normal python and cannot be used. Because and can only work with single values and not a series of boolean values.

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [49]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df['states'] = 'ab cd ef gh ij'.split(' ')
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     ab
B  0.651118 -0.319318 -0.848077  0.605965     cd
C -2.018168  0.740122  0.528813 -0.589001     ef
D  0.188695 -0.758872 -0.933237  0.955057     gh
E  0.190794  1.978757  2.605967  0.683509     ij

In [54]:
df.set_index('states')

               W         X         Y         Z
states
ab      2.706850  0.628133  0.907969  0.503826
cd      0.651118 -0.319318 -0.848077  0.605965
ef     -2.018168  0.740122  0.528813 -0.589001
gh      0.188695 -0.758872 -0.933237  0.955057
ij      0.190794  1.978757  2.605967  0.683509

In [55]:
df['states']

A    ab
B    cd
C    ef
D    gh
E    ij
Name: states, dtype: object

In [57]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     ab
B  0.651118 -0.319318 -0.848077  0.605965     cd
C -2.018168  0.740122  0.528813 -0.589001     ef
D  0.188695 -0.758872 -0.933237  0.955057     gh
E  0.190794  1.978757  2.605967  0.683509     ij

In [58]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [59]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [60]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [62]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [63]:
df.index.names

FrozenList([None, None])

In [64]:
df.index.names = ['First', 'Second']
df.index.names

FrozenList(['First', 'Second'])

In [65]:
df

                     A         B
First Second
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

In [66]:
df.xs('G1')

               A         B
Second
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [67]:
df.xs(1,level='Second')

              A         B
First
G1     0.302665  1.693723
G2     0.166905  0.184502

Pandas - Missing Data

In [69]:
d = {'A' : [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C':[1, 2, 3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [70]:
df.dropna(axis = 0)

     A    B  C
0  1.0  5.0  1

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [76]:
df.dropna(thresh = 3)

     A    B  C
0  1.0  5.0  1

In [77]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [78]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [79]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 350]}

In [80]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [82]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [83]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

MERGING, JOINING and CONCATENATING

OPERATIONS

In [84]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [
                  444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [85]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [86]:
df['col2'].nunique()

3

In [87]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [88]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [89]:
df[df['col2'] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [92]:
df['col1'] = df['col1'] / 10

In [93]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [94]:
def times2(x):
    return x * 2

In [95]:
df['col1'].apply(times2)

0    2.0
1    4.0
2    6.0
3    8.0
Name: col1, dtype: float64

In [96]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [97]:
df.sort_values('col2')

   col1  col2 col3
0   1.0   444  abc
3   4.0   444  xyz
1   2.0   555  def
2   3.0   666  ghi

In [98]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

INPUT AND OUTPUT DATA

In [2]:
import numpy as np
import pandas as pd

In [4]:
pwd

'c:\\Users\\priya\\Documents\\Projects\\Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [8]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
pd.read_excel('Excel_Sample.xlsx', engine='xlrd')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15